In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [8]:
ser1 = Series(range(4),index = ['A','B','C','D'])
ser1

A    0
B    1
C    2
D    3
dtype: int32

In [9]:
ser1 *= 2
ser1

A    0
B    2
C    4
D    6
dtype: int32

In [10]:
ser1['B']

2

In [11]:
ser1[1]

2

In [12]:
ser1[1:4]

B    2
C    4
D    6
dtype: int32

In [14]:
ser1[['A','C']]

A    0
C    4
dtype: int32

In [19]:
ser1[['True','True','False','False']]

True    NaN
True    NaN
False   NaN
False   NaN
dtype: float64

In [21]:
ser1[[2,3]]

C    4
D    6
dtype: int32

In [24]:
ser1>3

A    False
B    False
C     True
D     True
dtype: bool

In [22]:
ser1[ser1>3]

C    4
D    6
dtype: int32

In [26]:
ser1

A    0
B    2
C    4
D    6
dtype: int32

In [28]:
ser1[ser1>3]=10
ser1

A     0
B     2
C    10
D    10
dtype: int32

In [31]:
df1 = DataFrame(np.arange(25).reshape((5,5)), index = ['ind%s'%str(i+1) for i in range(5)],
               columns = ['col%s'%str(i+1) for i in range(5)])
df1

      col1  col2  col3  col4  col5
ind1     0     1     2     3     4
ind2     5     6     7     8     9
ind3    10    11    12    13    14
ind4    15    16    17    18    19
ind5    20    21    22    23    24

In [33]:
df1['col1']

ind1     0
ind2     5
ind3    10
ind4    15
ind5    20
Name: col1, dtype: int32

In [34]:
df1[['col1','col2']]

      col1  col2
ind1     0     1
ind2     5     6
ind3    10    11
ind4    15    16
ind5    20    21

In [35]:
df1[[1,2]]

      col2  col3
ind1     1     2
ind2     6     7
ind3    11    12
ind4    16    17
ind5    21    22

In [41]:
df1[[i for i in range(3)]]

      col1  col2  col3
ind1     0     1     2
ind2     5     6     7
ind3    10    11    12
ind4    15    16    17
ind5    20    21    22

In [42]:
df1[df1>5]

      col1  col2  col3  col4  col5
ind1   NaN   NaN   NaN   NaN   NaN
ind2   NaN     6     7     8     9
ind3    10    11    12    13    14
ind4    15    16    17    18    19
ind5    20    21    22    23    24

In [43]:
df1[df1['col1']>10]

      col1  col2  col3  col4  col5
ind4    15    16    17    18    19
ind5    20    21    22    23    24

In [44]:
df1>5

       col1   col2   col3   col4   col5
ind1  False  False  False  False  False
ind2  False   True   True   True   True
ind3   True   True   True   True   True
ind4   True   True   True   True   True
ind5   True   True   True   True   True

In [46]:
df1['col1']>5

ind1    False
ind2    False
ind3     True
ind4     True
ind5     True
Name: col1, dtype: bool